title: Kerberoasting Attack Pattern Detected
id: 08e141a2-5772-4ef7-af39-f8cb3aeb2ced
status: experimental
description: Attacker executing a Kerberoasting attack via TGS request or known tools like Rubeus, Mimikatz, or Impacket
author: EvilTom
date: 2025/05/29
modified: 2025/05/30
logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  tgs_request:
    EventID: 4769
    TicketEncryptionType: '0x17'

  rubeus_tool:
    EventID: 1
    Image|endswith: 'rubeus.exe'

  mimikatz_command:
    EventID: 1
    CommandLine|contains: 'kerberos::list'

  impacket_tool:
    EventID: 1
    CommandLine|contains: 'GetUserSPNs.py'

  condition: 1 of tgs_request, rubeus_tool, mimikatz_command, impacket_tool

level: high
tags:
  - attack.t1558.003
  - attack.credential_access
